{
  "translation": {
    "Projects": "Projetos",
    "About": "Sobre",
    "About me": "Sobre mim",
    "Contact": "Contato",
    "Contact me": "Contato",
    "Home": "Início",
    "Your name": "Seu nome",
    "Your e-mail": "Seu e-mail",
    "example@example.com": "exemplo@exemplo.com",
    "Your message": "Sua mensagem",
    "Type your message here": "Digite sua mensagem aqui",
    "Submit": "Enviar",
    "Hi, I'm Zini! Software developer ready to work with:": "Olá, eu sou o Zini! Desenvolvedor de software pronto para trabalhar com:",
    "Here you can find some of the projects that I've developed so far.": "Aqui você pode encontrar alguns dos projetos que eu desenvolvi até agora.",
    "Keep in touch to see newer ones as I develop more!": "Mantenha contato para ver novos projetos à medida que forem desenvolvidos!",
    "Recipes App": "App de Receitas",
    "This is an app that shows meals and drinks recipes, allow the user to keep track of the steps and ingredients, and also to favorite, filter and search for recipes. It was made with React and ContextAPI to manage the state, and followed a mobile-first approach.": "Este é um aplicativo que mostra receitas de refeições e bebidas, permite ao usuário acompanhar os passos e ingredientes, além de favoritar, filtrar e pesquisar receitas. Foi feito com React e ContextAPI para gerenciar o estado, e seguiu uma abordagem mobile-first.",
    "Music Snippets": "Music Snippets",
    "Fully responsive app that allows the user to search for artists and songs, to save them as favorites and edit their profile in the app.": "Aplicativo totalmente responsivo que permite ao usuário pesquisar artistas e músicas, salvá-los como favoritos e editar seu perfil no aplicativo.",
    "Talker Manager": "Talker Manager",
    "This is a back-end project that allows the user to create, edit and delete (CRUD) talkers for an event. It was made with Node.js, Express, Docker and MySQL. It follows a layered architecture, with a service layer, a controller layer and a model layer.": "Este é um projeto back-end que permite ao usuário criar, editar e excluir (CRUD) palestrantes para um evento. Foi feito com Node.js, Express, Docker e MySQL. Segue uma arquitetura em camadas, com uma camada de serviços, uma camada de controllers e uma camada de modelos.",
    "Top Trumps Drag": "Super Trunfo Drag",
    "Inspired by the Top Trumps games, I developed this one starring drag queens from the reality show 'RuPaul's Drag Race'. It was made with React and class components, to showcase the ability to work with legacy projects.": "Inspirado nos jogos de Super Trunfo, desenvolvi este jogo estrelado por drag queens do programa de televisão 'RuPaul's Drag Race'. Criado com React e componentes de classe, com o intuito de demonstrar a habilidade de trabalhar com projetos legados.",
    "Solar System": "Sistema Solar",
    "Simple landing page, made with React, about space missions in our solar system. All animations were made using pure CSS, to explore its possibilities.": "Página simples, feita com React, sobre missões espaciais em nosso sistema solar. Todas as animações foram feitas usando CSS puro, para explorar suas capacidades.",
    "Hello, my name is João Felipe Zini Hespanhol, and I'm passionate about technology. I've always had an affinity for the field, but I grew up in a conservative environment that limited my career options. As a result, I was directed to study Law, just like my father.": "Olá, meu nome é João Felipe Zini Hespanhol, e sou apaixonado por tecnologia. Sempre tive afinidade com a área, mas cresci em um ambiente conservador que limitou minhas opções de carreira. Como resultado, fui direcionado a estudar Direito, assim como meu pai.",
    "My academic journey in law was marked by excellence, allowing me to solve various problems and explore new areas. However, even though I achieved some stability, Law didn't provide me with a sense of professional fulfillment.": "Minha trajetória acadêmica no Direito foi marcada pela excelência, permitindo-me resolver múltiplos problemas e explorar novas áreas. No entanto, apesar de ter alcançado alguma estabilidade, o Direito não me proporcionou um senso de realização profissional.",
    "To change this, I planned a transition to my true passion: software development. I acquired technical skills in various technologies, both in Front-end and Back-end, and I'm eager to embark on this new journey with enthusiasm and dedication.": "Para mudar isso, planejei uma transição para minha verdadeira paixão: desenvolvimento de software. Adquiri habilidades técnicas em várias tecnologias, tanto no Front-end quanto no Back-end, e estou ansioso para embarcar nesta nova jornada com entusiasmo e dedicação.",
    "Trip Wallet": "Carteira de viagens",
    "This project consists of the creation of a Landing Page with Chatbot for the product SP Labs": "Este projeto consiste na criação de uma Landing Page com Chatbot para o produto SP Labs",
    "This project is a simulation of a wallet, where you can add expenses, convert the spent currencies to Brazilian Real, and view a table with the total expenses. The development was carried out using Redux, React, React Router, and Middlewares for handling asynchronous actions. The tests were developed with React Testing Library.": "Este projeto é uma simulação de uma carteira, onde você pode adicionar despesas, converter as moedas gastas para Real Brasileiro e visualizar uma tabela com as despesas totais. O desenvolvimento foi realizado usando Redux, React, React Router e Middlewares para lidar com ações assíncronas. Os testes foram desenvolvidos com React Testing Library.",
    "This is an API developed using Docker, Node.js, Express and MySQL but the true focus of the project is the testing. It has unit and integration tests, with 100% coverage and quality assured by mutation tests with Stryker.": "Esta é uma API desenvolvida utilizado Docker, Node.js, Express e MySQL, porém, o verdadeiro foco do projeto está em seus testes. Ele possui testes unitários e de integração, com 100% de cobertura e qualidade garantida por testes de mutação utilizando Stryker."
  }
}
